Revit.Filter.OverrideGraphicSettings
Override Graphic Settings

Revit.Filter.OverrideGraphicSettings.InternalOverrideGraphicSettings
Internal reference to the Revit Element

Revit.Filter.OverrideGraphicSettings.#ctor(Autodesk.Revit.DB.OverrideGraphicSettings)
Reference to the Element

Revit.Filter.OverrideGraphicSettings.ByProperties(DSCore.Color,DSCore.Color,DSCore.Color,DSCore.Color,Revit.Elements.FillPatternElement,Revit.Elements.FillPatternElement,Revit.Elements.LinePatternElement,Revit.Elements.LinePatternElement,System.Int32,System.Int32,System.Int32,System.String,System.Boolean)
Create a OverrideGraphicSettings Element.
cutFillColor: Fill color
projectionFillColor: Projection color
cutLineColor: Cut line color
projectionLineColor: Projection line color
cutLineWeight: Cut line weight
projectionLineWeight: Projection line weight
cutFillPattern: Cut fill pattern
projectionFillPattern: Projection fill pattern
cutLinePattern: Cut line pattern
projectionLinePattern: Projection line pattern
transparency: Transparency as integer between 1-100.
detailLevel: Detail Level setting, ex: Coarse, Fine etc.
halftone: Halftone. True = halftone.
Override Graphic Settings

Revit.Filter.OverrideGraphicSettings.ToRevitColor(DSCore.Color)
Revit Color to DS Color
color:
Returns: